aboutJava/lombok.org
#+TITLE: lombok的使用

lombok 提供了简单的注解的形式来帮助我们简化消除一些必须有但显得很臃肿的 java 代码。

* 常用的 lombok 注解
#+BEGIN_SRC
@Data:注解在类上；提供类所有属性的 getting 和 setting 方法，此外还提供了equals、canEqual、hashCode、toString 方法

@Setter:注解在属性上；为属性提供 setting 方法

@Getter:注解在属性上；为属性提供 getting 方法

@Log4j:注解在类上；为类提供一个 属性名为log 的 log4j 日志对象

@Slf4j:取代Log4j

@NoArgsConstructor:注解在类上；为类提供一个无参的构造方法

@AllArgsConstructor:注解在类上；为类提供一个全参的构造方法
#+END_SRC

* maven构建项目
#+BEGIN_SRC
<!-- Lombok -->
<dependency>
  <groupId>org.projectlombok</groupId>
  <artifactId>lombok</artifactId>
  <version>1.16.10</version>
</dependency>
<!-- logger -->
  <dependency>
  <groupId>org.slf4j</groupId>
  <artifactId>slf4j-api</artifactId>
  <version>1.7.21</version>
</dependency>
<dependency>
  <groupId>org.slf4j</groupId>
  <artifactId>slf4j-log4j12</artifactId>
  <version>1.7.21</version>
</dependency>
#+END_SRC

* Java代码demo
#+BEGIN_SRC
package com.qzt360.BASystemSpringboot.stat;

import lombok.AllArgsConstructor;
import lombok.Data;
import lombok.NoArgsConstructor;

@Data
@NoArgsConstructor
@AllArgsConstructor
public class DataStatus {
	private long lAWifiAuthlogCount;// 终端上下线条数
	private long lAWifiNetlogCount;// 审计日志条数
	private long lAWifiNetIdlogCount;// 虚拟身份日志条数
	private long lAWifiEqpCount;// aWifi设备个数
	private long lIdCount;// 身份个数
}

#+END_SRC

* eclipse中使用lombok
新下载的eclipse会有问题，解决办法：
1. 在Maven Dependencies中找到lombok-1.16.10.jar
2. 右键，Run As Java Application
3. 弹出页面，点Install/Update就搞定了
4. 如果你是MacOS系统，会提示I can't find any IDEs on your computer,
你要手工选择路径,Specify location...
YourEclipse.app/Contents/Eclipse/eclipse.ini,
点Install/Update，你会发现在YourEclipse.app/Contents/Eclipse/目录有个lombok.jar,
mv lombok.jar ./plugins,
修改eclipse.ini中的-javaagent:../Eclipse/plugins/lombok.jar，
重启eclipse就OK了。

Enjoy your coding life.
