aboutJava/lombok.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>lombok的使用</title>
<!-- 2016-09-21 Wed 23:22 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="赵光建" />
</head>
<body>
<div id="content">
<h1 class="title">lombok的使用</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 常用的 lombok 注解</a></li>
<li><a href="#sec-2">2. maven构建项目</a></li>
<li><a href="#sec-3">3. Java代码demo</a></li>
<li><a href="#sec-4">4. eclipse中使用lombok</a></li>
</ul>
</div>
</div>
<p>
lombok 提供了简单的注解的形式来帮助我们简化消除一些必须有但显得很臃肿的 java 代码。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 常用的 lombok 注解</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
@Data:注解在类上；提供类所有属性的 getting 和 setting 方法，此外还提供了equals、canEqual、hashCode、toString 方法

@Setter:注解在属性上；为属性提供 setting 方法

@Getter:注解在属性上；为属性提供 getting 方法

@Log4j:注解在类上；为类提供一个 属性名为log 的 log4j 日志对象

@Slf4j:取代Log4j

@NoArgsConstructor:注解在类上；为类提供一个无参的构造方法

@AllArgsConstructor:注解在类上；为类提供一个全参的构造方法
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> maven构建项目</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
&lt;!-- Lombok --&gt;
&lt;dependency&gt;
  &lt;groupId&gt;org.projectlombok&lt;/groupId&gt;
  &lt;artifactId&gt;lombok&lt;/artifactId&gt;
  &lt;version&gt;1.16.10&lt;/version&gt;
&lt;/dependency&gt;
&lt;!-- logger --&gt;
  &lt;dependency&gt;
  &lt;groupId&gt;org.slf4j&lt;/groupId&gt;
  &lt;artifactId&gt;slf4j-api&lt;/artifactId&gt;
  &lt;version&gt;1.7.21&lt;/version&gt;
&lt;/dependency&gt;
&lt;dependency&gt;
  &lt;groupId&gt;org.slf4j&lt;/groupId&gt;
  &lt;artifactId&gt;slf4j-log4j12&lt;/artifactId&gt;
  &lt;version&gt;1.7.21&lt;/version&gt;
&lt;/dependency&gt;
</pre>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Java代码demo</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
package com.qzt360.BASystemSpringboot.stat;

import lombok.AllArgsConstructor;
import lombok.Data;
import lombok.NoArgsConstructor;

@Data
@NoArgsConstructor
@AllArgsConstructor
public class DataStatus {
	private long lAWifiAuthlogCount;// 终端上下线条数
	private long lAWifiNetlogCount;// 审计日志条数
	private long lAWifiNetIdlogCount;// 虚拟身份日志条数
	private long lAWifiEqpCount;// aWifi设备个数
	private long lIdCount;// 身份个数
}
</pre>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> eclipse中使用lombok</h2>
<div class="outline-text-2" id="text-4">
<p>
新下载的eclipse会有问题，解决办法：
</p>
<ol class="org-ol">
<li>在Maven Dependencies中找到lombok-1.16.10.jar
</li>
<li>右键，Run As Java Application
</li>
<li>弹出页面，点Install/Update就搞定了
</li>
<li>如果你是MacOS系统，会提示I can't find any IDEs on your computer,
</li>
</ol>
<p>
你要手工选择路径,Specify location&#x2026;
YourEclipse.app/Contents/Eclipse/eclipse.ini,
点Install/Update，你会发现在YourEclipse.app/Contents/Eclipse/目录有个lombok.jar,
mv lombok.jar ./plugins,
修改eclipse.ini中的-javaagent:../Eclipse/plugins/lombok.jar，
重启eclipse就OK了。
</p>

<p>
Enjoy your coding life.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 赵光建</p>
<p class="date">Created: 2016-09-21 Wed 23:22</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
